# 19 Creating Manual Data Frame

In [14]:
import pandas as pd

In [15]:
pd.DataFrame({'id': [1,2,3,4], 'customerName': ['Tom', 'Harry', 'Peter', 'Thomas'], 'age':[20,25,34,45]})

   id customerName  age
0   1          Tom   20
1   2        Harry   25
2   3        Peter   34
3   4       Thomas   45

In [20]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

> https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isnull.html
> https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isnull.html

In [21]:
pd.isnull(ufo).head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [22]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False